/**
 * 算法：1、求取数组中的众数；2、斐波那契数列；3、猴子吃桃(每次吃前一天的一半，再加1)
 * 
 * 手写：
 * 实现new（问题，实现new就不要使用new了）
 * 升序数组，如果包含数字则返回下标，否则返回false(考察二分查找)
 * 取出字符串中的数字。match方法 + 其他方法
 * 
 * ！！！闭包打印（函数执行两次的闭包打印）、newPromise输出（同步任务、异步任务、宏任务、微任务）
 * 
 * 数据类型
 * 深浅拷贝的区别
 * web缓存（如果存储数据超过5M，怎么办？实际可以存储10M字符？）
 * 
 * ！！！less或着Sass实现批量生成颜色卡片
 * position定位，sticky定位对父元素有什么要求？
 * 怎么实现0.5px边框？为什么有0.5px？使用0.5px有什么影响（有的展示1px，有的展示0px）
 * 
 * 
 * 类组件与函数组件的区别
 * 类的实例为什么要绑定类的方法？
 * 子类继承，不写super会报错
 * Redux三大原则
 * 单页应用的路由是怎么实现的
 * 
 * ！！！Promise.all、Promise.race、Promise.allSettled区别
 * 
 * 公司前端：4人。主要使用react、公司内部的图形化工具
 * 
 * 
 * 前端团队
 * 前端项目 + 技术
 * 部门成长规划
 * 
 */